Revit 2027 API
ParameterTypeId.RebarConstraintsStatus Property
 "Rebar Constraint Status"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarConstraintsStatus { get; }
Public Shared ReadOnly Property RebarConstraintsStatus As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarConstraintsStatus {
	ForgeTypeId^ get ();
}
static member RebarConstraintsStatus : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace